Tekla.Structures.Drawing.DWGScalingOptions
The options for controlling the scaling of the objects in the drawing.

Tekla.Structures.Drawing.DWGScalingOptions.ScaleX
Scales the DWG or DXF object in the X direction.

Tekla.Structures.Drawing.DWGScalingOptions.ScaleXY
Scales the DWG or DXF object in the X and Y directions.

Tekla.Structures.Drawing.DWGScalingOptions.ScaleToFit
Scales the object to fit in the frame in the Y direction.

Tekla.Structures.Drawing.DWGScalingOptions.ScaleBestFit
The DWG or DXF object is scaled inside the frame,
still maintaining its original aspect ratio.